Catalogs/Б24_К_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Б24_К_НастройкиПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийВебхук</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьАдресаРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗагружатьАдресаРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДелаБитрикс24</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбсужденияВЧатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьПользователейБитрикс24ОбОшибках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонияБитрикс24</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортПечатныхФормОтчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДанныхОбОшибках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователяБитрикс24</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрыСообщенийОбОшибках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевойТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченияНаВыгрузкуДелСозданныхПоОснованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыШаблоновРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеШаблона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдШаблона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыСтавокНДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтавкиНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтавки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиКлиентовОтТиповКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыТиповКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочиеОтношения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конкурент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Б24_К_ОбщегоНазначенияВызовСервераПовтИсп/Ext/Module.bsl
#Область ФункциональностьБазы1С

Функция ДополнительныеРеквизитыИСведенияИспользуются() Экспорт
	
	Возврат Истина; 
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") = Истина;
	
КонецФункции

Функция ХарактеристикиНоменклатурыИспользуются() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") = Истина;
	
КонецФункции

Функция ВестиНезависимоПартнеровИКонтрагентов() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов") = Истина;
	
КонецФункции

#КонецОбласти


#Область Прочие

// Функция - Проверяет, является ли база 1С копией
// 
// Возвращаемое значение:
//   Булево - Истина, если это копия базы 1С.
//
Функция ЭтоКопияБазы() Экспорт
	
	Возврат БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована();
	
КонецФункции

Функция ПолучитьТекущегоПользователя() Экспорт
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

// Функция - Проверяет, используется ли база 1С в модели сервиса
// 
// Возвращаемое значение:
//   Булево - Истина, если база 1С используется в модели сервиса.
//
Функция БазаИспользуетсяВМоделиСервиса() Экспорт
	
	Возврат ОбщегоНазначения.РазделениеВключено(); 	
	
КонецФункции  

// Функция - Проверяет, установлен ли модуль интеграции
// 
// Возвращаемое значение:
//   Булево - Истина, если модуль интеграции установлен.
//
Функция МодульИнтеграцииУстановлен() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьИмяРасширения()));
	
	Если НайденныеРасширения.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат НайденныеРасширения[0].Активно;
	КонецЕсли;
	
КонецФункции

Функция РасширениеВБезопасномРежиме() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьИмяРасширения()));
	Если НайденныеРасширения.Количество() > 0 Тогда
		Результат = НайденныеРасширения[0].БезопасныйРежим;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьПраваНаРаботуСМодулем() Экспорт
	
	Если Пользователи.РолиДоступны("ПолныеПрава") ИЛИ Пользователи.РолиДоступны("Б24_К_Администратор") ИЛИ Пользователи.РолиДоступны("Б24_К_Пользователь") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоПолноправныйПользователь() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь();
	
КонецФункции    

// Функция - Проверяется, существую ли такая подсистема модуля. Поиск 2 уровневый 
//
// Параметры:
//  ИмяПодсистемы   - Строка - Наименование подсистемы;
// 
// Возвращаемое значение:
//   Булево - Истина, если существуют подсистема модуля. 
//
Функция ПодсистемаСуществует(ИмяПодсистемы) Экспорт 
	
			Возврат Истина;
	Для Каждого ТекПодсистема1 Из Метаданные.Подсистемы.Б24_К_Битрикс24.Подсистемы Цикл
		
		Если ТекПодсистема1.Имя = ИмяПодсистемы Тогда
			Возврат Истина;
		КонецЕсли;
		
		Для Каждого ТекПодсистема2 Из ТекПодсистема1.Подсистемы Цикл
			Если ТекПодсистема2.Имя = ИмяПодсистемы Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОбщиеНастройкиПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Открывать1СИзБитрикс24"				, Истина);
	Результат.Вставить("ВебАдрес1С"							, "<Введите https адрес информационной базы 1С на веб-сервере>");
	Результат.Вставить("ЗапускатьВРежимеРабочегоСтола"		, Ложь);
	Результат.Вставить("СпособОткрытия1С"					, "Холодный старт");
	Результат.Вставить("ИспользуемыйБраузер"				, "Браузер ОС по умолчанию");
	
	СписокЗначенийТипПользователи = Новый СписокЗначений;
	СписокЗначенийТипПользователи.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи"); 
	Результат.Вставить("Пользователи1СДляБезопасности"		, СписокЗначенийТипПользователи);
	
	Результат.Вставить("ДелатьЗапросНаВнешнийСервис"		, Ложь);
	Результат.Вставить("АдресЗапросаНаВнешнийСервис"		, "");
	
	Результат.Вставить("ОбрезатьИсториюОбменов"				, Истина);
	Результат.Вставить("РежимОтладки"						, Ложь);
	Результат.Вставить("ЧислоДнейХраненияИстории"			, 7);
	Результат.Вставить("ХранитьИнформациюОбОшибках"			, Ложь);
	
	Результат.Вставить("ОповещатьООшибкахПользователей1С"	, Ложь);
	
	СписокЗначенийТипПользователи = Новый СписокЗначений;
	СписокЗначенийТипПользователи.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи"); 
	Результат.Вставить("ОповещающиесяПользователи1С"		, СписокЗначенийТипПользователи);
	
	Результат.Вставить("ОповещатьООшибкахНаПочту"			, Ложь);
	Результат.Вставить("УчетнаяЗаписьЭлектроннойПочты"		, Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка());
	
	СписокЗначенийТипСтрока = Новый СписокЗначений;
	СписокЗначенийТипСтрока.ТипЗначения = Новый ОписаниеТипов("Строка"); 
	Результат.Вставить("ЭлектронныеПочтыПолучатели"			, СписокЗначенийТипСтрока);
	
	
	Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() Тогда
		СпособВзаимодействияСБитрикс24 = "Через http-сервисы";
	Иначе
		СпособВзаимодействияСБитрикс24 	= "Через push&pull сервер";
	КонецЕсли;
	Результат.Вставить("СпособВзаимодействияСБитрикс24"	, СпособВзаимодействияСБитрикс24);
	Результат.Вставить("ИмяПользователяHTTP"			, "");
	Результат.Вставить("ПарольПользователяHTTP"			, "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруВидовКИКонтрагентов() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПочтаРабочий"		, Справочники.ВидыКонтактнойИнформации.EmailПартнера); 	
	Результат.Вставить("ТелефонРабочий"		, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера); 	
	Результат.Вставить("ПочтаЧастная"		, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("ТелефонМобильный"	, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("ТелефонДомашний"	, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	Результат.Вставить("ПочтаРабочийОрг"		, Справочники.ВидыКонтактнойИнформации.EmailОрганизации); 	
	Результат.Вставить("ТелефонРабочийОрг"		, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации); 	
	Результат.Вставить("ПочтаЧастнаяОрг"		, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("ТелефонМобильныйОрг"	, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("ТелефонДомашнийОрг"		, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	Результат.Вставить("ПочтаРабочийКонЛица"		, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица); 	
	Результат.Вставить("ТелефонРабочийКонЛица"		, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица); 	
	Результат.Вставить("ПочтаЧастнаяКонЛица"		, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	Результат.Вставить("ТелефонМобильныйКонЛица"	, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	Результат.Вставить("ТелефонДомашнийКонЛица"		, Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	Выборка = Справочники.ВидыКонтактнойИнформации.Выбрать(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
	
	ЕстьПочтаЧастная 	= Ложь;
	ЕстьТелефонМоб 		= Ложь;
	ЕстьТелефонДом 		= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И Выборка.Наименование = "Частный" Тогда
			ЕстьПочтаЧастная = Истина;	
			Результат.ПочтаЧастная = Выборка.Ссылка;	
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Выборка.Наименование = "Мобильный" Тогда
			ЕстьТелефонМоб = Истина;	
			Результат.ТелефонМобильный = Выборка.Ссылка;	
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Выборка.Наименование = "Домашний" Тогда
			ЕстьТелефонДом = Истина;	
			Результат.ТелефонДомашний = Выборка.Ссылка;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьПочтаЧастная Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПартнеры;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		НовыйКИ.Наименование = "Частный";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ПочтаЧастная = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ЕстьТелефонМоб Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПартнеры;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйКИ.Наименование = "Мобильный";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ТелефонМобильный = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ЕстьТелефонДом Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПартнеры;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйКИ.Наименование = "Домашний";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ТелефонДомашний = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	ЕстьПочтаЧастная 	= Ложь;
	ЕстьТелефонМоб 		= Ложь;
	ЕстьТелефонДом 		= Ложь;
	
	
	Выборка = Справочники.ВидыКонтактнойИнформации.Выбрать(Справочники.ВидыКонтактнойИнформации.СправочникОрганизации);
	
	ЕстьПочтаЧастная 	= Ложь;
	ЕстьТелефонМоб 		= Ложь;
	ЕстьТелефонДом 		= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И Выборка.Наименование = "Частный" Тогда
			ЕстьПочтаЧастная = Истина;	
			Результат.ПочтаЧастнаяОрг = Выборка.Ссылка;	
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Выборка.Наименование = "Мобильный" Тогда
			ЕстьТелефонМоб = Истина;	
			Результат.ТелефонМобильныйОрг = Выборка.Ссылка;	
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Выборка.Наименование = "Домашний" Тогда
			ЕстьТелефонДом = Истина;	
			Результат.ТелефонДомашнийОрг = Выборка.Ссылка;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьПочтаЧастная Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникОрганизации;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		НовыйКИ.Наименование = "Частный";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ПочтаЧастнаяОрг = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ЕстьТелефонМоб Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникОрганизации;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйКИ.Наименование = "Мобильный";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ТелефонМобильныйОрг = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ЕстьТелефонДом Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникОрганизации;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйКИ.Наименование = "Домашний";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ТелефонДомашнийОрг = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Выборка = Справочники.ВидыКонтактнойИнформации.Выбрать(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
	
	ЕстьПочтаЧастная 	= Ложь;
	ЕстьТелефонДом 		= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И Выборка.Наименование = "Частный" Тогда
			ЕстьПочтаЧастная = Истина;	
			Результат.ПочтаЧастнаяКонЛица = Выборка.Ссылка;	
		КонецЕсли;
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И Выборка.Наименование = "Домашний" Тогда
			ЕстьТелефонДом = Истина;	
			Результат.ТелефонДомашнийКонЛица = Выборка.Ссылка;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьПочтаЧастная Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		НовыйКИ.Наименование = "Частный";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ПочтаЧастнаяКонЛица = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Если НЕ ЕстьТелефонДом Тогда
		НовыйКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйКИ.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
		НовыйКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовыйКИ.Наименование = "Домашний";
		НовыйКИ.Используется = Истина;
		НовыйКИ.Записать();
		
		Результат.ТелефонДомашнийКонЛица = НовыйКИ.Ссылка;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВалютаПоУмолчанию() Экспорт
	Возврат Константы.ВалютаУправленческогоУчета.Получить();
КонецФункции

Функция ИнформационнаяБазаФайловая() Экспорт
	
	Возврат ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
КонецФункции

Функция РольДоступнаНаКлиенте(ИмяРоли) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РольДоступна(ИмяРоли);     
	
КонецФункции

#КонецОбласти


#Область РаботаСНастройками

Функция ПолучитьМассивНастроекПодключения(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
	Запрос = Новый Запрос;
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_НастройкиПодключения.Ссылка КАК Настройка
	|ИЗ
	|	Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_К_НастройкиПодключения."+КлючНастройки+" = &ПараметрПоиска";
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Настройка");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоНастроекПодключения(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
УстановитьПривилегированныйРежим(Истина);
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Б24_К_НастройкиПодключения.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_К_НастройкиПодключения."+КлючНастройки+" = &ПараметрПоиска";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Количество; 
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуПодключенияПоУмолчанию(КлючНастройки = "", ЗначениеНастройки = "") Экспорт
	
УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.Б24_К_НастройкиПодключения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.УстановитьПараметр("ПараметрПоиска", ЗначениеНастройки);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_НастройкиПодключения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|ГДЕ
	|	Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	
	Если НЕ КлючНастройки = "" Тогда
		Запрос.Текст = Запрос.Текст + "
		|" + " И Б24_К_НастройкиПодключения."+КлючНастройки+" = &ПараметрПоиска";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка; 	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкуПодключенияПоПорталу(Портал) Экспорт
	
	Результат = Неопределено;
	
	Выборка = Справочники.Б24_К_НастройкиПодключения.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Портал = Портал И НЕ Выборка.ПометкаУдаления Тогда
			Результат = Выборка.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиПодключенияСЗапретомНаСозданияДелНаОсновании(ПолноеИмяОбъекта) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ПолноеИмяОбъекта", ПолноеИмяОбъекта); 
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_НастройкиПодключенияОграниченияНаВыгрузкуДелСозданныхПоОснованию.Ссылка КАК НастройкаПодключения
	|ИЗ
	|	Справочник.Б24_К_НастройкиПодключения.ОграниченияНаВыгрузкуДелСозданныхПоОснованию КАК Б24_К_НастройкиПодключенияОграниченияНаВыгрузкуДелСозданныхПоОснованию
	|ГДЕ
	|	Б24_К_НастройкиПодключенияОграниченияНаВыгрузкуДелСозданныхПоОснованию.ПолноеИмяОбъекта = &ПолноеИмяОбъекта";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаПодключения");
	
	Возврат Результат;
	
КонецФункции


Функция ТипыКонтрагентовДляКомпаний(НастройкаПодключения) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_НастройкиПодключенияЗависимостиКлиентовОтТиповКонтрагентов.Тип КАК Тип
	|ИЗ
	|	Справочник.Б24_К_НастройкиПодключения.ЗависимостиКлиентовОтТиповКонтрагентов КАК Б24_К_НастройкиПодключенияЗависимостиКлиентовОтТиповКонтрагентов
	|ГДЕ
	|	Б24_К_НастройкиПодключенияЗависимостиКлиентовОтТиповКонтрагентов.ВидКлиента = ""Компания""";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Тип");
	
	Возврат Результат;
	
КонецФункции   

#КонецОбласти
